import os,sys,re
area={
	'山东省':{
		'青岛市':['市辖区','四方区','黄岛区','李沧区','即墨市','平度市','胶南市','崂山区','莱西市','胶州市','市南区','市北区','城阳区'],
		'东营市':['市辖区','河口区','利津县','广饶县','东营区','垦利县'],
		'烟台市':['芝罘区','牟平区','莱山区','莱阳市','莱州市','招远市','福山区','蓬莱市','海阳市','市辖区','龙口市','栖霞市','长岛县'],
		'潍坊市':['市辖区','潍城区','奎文区','昌乐县','青州市','安丘市','高密市','昌邑市','寒亭区','寿光市','坊子区','诸城市','临朐县'],
		'济宁市':['市中区','微山县','鱼台县','汶上县','泗水县','曲阜市','邹城市','任城区','嘉祥县','梁山县','市辖区','金乡县','兖州市'],
		'临沂市':['罗庄区','沂南县','郯城县','费县','平邑县','蒙阴县','临沭县','河东区','莒南县','苍山县','市辖区','兰山区','沂水县'],
		'德州市':['德城区','陵县','庆云县','临邑县','齐河县','夏津县','武城县','乐陵市','市辖区','宁津县','平原县','禹城市'],
		'聊城市':['市辖区','东昌府区','莘县','茌平县','东阿县','高唐县','临清市','阳谷县','冠县'],
		'滨州市':['滨城区','惠民县','无棣县','沾化县','博兴县','市辖区','阳信县','邹平县'],
		'菏泽市':['市辖区','牡丹区','单县','成武县','巨野县','鄄城县','定陶县','东明县','曹县','郓城县'],
		'济南市':['市辖区','历下区','天桥区','历城区','平阴县','商河县','长清区','章丘市','槐荫区','市中区','济阳县'],
		'枣庄市':['市中区','峄城区','台儿庄区','滕州市','薛城区','市辖区','山亭区'],
		'泰安市':['宁阳县','东平县','新泰市','市辖区','岱岳区','肥城市','泰山区'],
		'威海市':['市辖区','环翠区','荣成市','文登市','乳山市'],
		'日照市':['市辖区','东港区','岚山区','莒县','五莲县'],
		'淄博市':['市辖区','淄川区','博山区','桓台县','高青县','沂源县','周村区','张店区','临淄区'],
		'莱芜市':['莱城区','钢城区','市辖区'],
	},
	'湖北省':{
		'十堰市':['张湾区','郧县','房县','茅箭区','竹山县','丹江口市','市辖区','郧西县','竹溪县'],
		'宜昌市':['市辖区','猇亭区','夷陵区','兴山县','宜都市','当阳市','枝江市','远安县','长阳土家族自治县','伍家岗区','西陵区','五峰土家族自治县','点军区','秭归县'],
		'荆门市':['东宝区','京山县','掇刀区','钟祥市','市辖区','沙洋县'],
		'孝感市':['孝南区','大悟县','安陆市','应城市','孝昌县','市辖区','汉川市','云梦县'],
		'荆州市':['荆州区','江陵县','沙市区','石首市','监利县','松滋市','市辖区','公安县','洪湖市'],
		'黄冈市':['市辖区','团风县','英山县','浠水县','蕲春县','武穴市','罗田县','红安县','麻城市','黄梅县','黄州区'],
		'随州市':['曾都区','广水市','随县','市辖区'],
		'省直辖县级行政区划':['仙桃市','天门市','神农架林区','潜江市'],
		'武汉市':['硚口区','青山区','市辖区','江岸区','汉阳区','武昌区','洪山区','东西湖区','蔡甸区','江夏区','新洲区','江汉区','汉南区','黄陂区'],
		'黄石市':['市辖区','西塞山区','下陆区','铁山区','阳新县','黄石港区','大冶市'],
		'恩施土家族苗族自治州':['利川市','建始县','巴东县','宣恩县','咸丰县','来凤县','鹤峰县','恩施市'],
		'襄阳市':['襄城区','南漳县','谷城县','枣阳市','襄州区','老河口市','樊城区','宜城市','市辖区','保康县'],
		'鄂州市':['市辖区','华容区','鄂城区','梁子湖区'],
		'咸宁市':['市辖区','咸安区','崇阳县','通山县','嘉鱼县','通城县','赤壁市'],
	}
}

def getArea(province,city,district):
	province=getProvice(province)
	city=getCity(province,city)
	district=getDistrict(province,city,district)
	return province,city,district

def getProvice(province):
	for realProvice in area.keys():
		if re.sub('省|市|区|县','',province) in realProvice:
			return realProvice
	print(province,'Not Found!')
	sys.exit()

def getCity(province,city):
	for realCity in area[province].keys():
		if re.sub('省|市|区|县','',city) in realCity:
			return realCity
	print(province,'没有',city,'!\t',province,':',list(area[province].keys()))
	sys.exit()

def getDistrict(province,city,district):
	for realProvice in area[province][city]:
		if re.sub('省|市|区|县','',district) in realProvice:
			return realProvice
	print(city,'没有',district,'!\t',city,':',area[province][city],'使用 市辖区')
	return '市辖区'

if __name__ == '__main__':
	print(getArea('山东省','威海市','文登县'))